</s>	0
the	1
<unk>	2
N	3
of	4
to	5
a	6
in	7
and	8
's	9
for	10
that	11
$	12
is	13
it	14
said	15
on	16
at	17
by	18
as	19
from	20
with	21
million	22
mr.	23
was	24
be	25
its	26
are	27
he	28
but	29
has	30
n't	31
an	32
have	33
will	34
new	35
or	36
company	37
they	38
this	39
which	40
year	41
would	42
about	43
market	44
says	45
more	46
were	47
had	48
billion	49
their	50
his	51
up	52
u.s.	53
one	54
than	55
stock	56
been	57
some	58
who	59
also	60
other	61
share	62
not	63
we	64
corp.	65
when	66
last	67
if	68
i	69
all	70
shares	71
president	72
years	73
trading	74
first	75
two	76
after	77
inc.	78
because	79
could	80
sales	81
&	82
out	83
there	84
do	85
only	86
business	87
such	88
most	89
can	90
co.	91
york	92
into	93
may	94
over	95
group	96
many	97
now	98
time	99
federal	100
companies	101
prices	102
no	103
government	104
so	105
any	106
cents	107
quarter	108
bank	109
investors	110
down	111
you	112
price	113
exchange	114
what	115
people	116
even	117
say	118
yesterday	119
much	120
big	121
while	122
months	123
securities	124
under	125
week	126
rose	127
bonds	128
them	129
stocks	130
major	131
next	132
three	133
net	134
interest	135
'	136
earnings	137
did	138
financial	139
still	140
make	141
chairman	142
american	143
just	144
earlier	145
board	146
through	147
investment	148
before	149
those	150
since	151
chief	152
industry	153
executive	154
these	155
state	156
money	157
national	158
off	159
friday	160
officials	161
program	162
expected	163
made	164
analysts	165
like	166
rate	167
she	168
unit	169
month	170
markets	171
days	172
does	173
house	174
profit	175
sell	176
buy	177
between	178
against	179
rates	180
both	181
plan	182
capital	183
firm	184
income	185
back	186
get	187
recent	188
revenue	189
japanese	190
ago	191
average	192
general	193
products	194
during	195
should	196
well	197
own	198
funds	199
index	200
international	201
offer	202
fell	203
issue	204
another	205
court	206
part	207
debt	208
then	209
take	210
trade	211
higher	212
among	213
including	214
her	215
being	216
however	217
japan	218
each	219
reported	220
according	221
world	222
computer	223
tax	224
vice	225
sale	226
plans	227
work	228
sold	229
lower	230
several	231
report	232
way	233
traders	234
past	235
operations	236
bid	237
our	238
increase	239
high	240
loss	241
end	242
less	243
common	244
very	245
banks	246
economic	247
where	248
growth	249
day	250
issues	251
third	252
good	253
closed	254
how	255
department	256
bill	257
foreign	258
few	259
early	260
futures	261
pay	262
five	263
cash	264
management	265
yield	266
insurance	267
bush	268
're	269
costs	270
used	271
oil	272
might	273
news	274
treasury	275
system	276
office	277
bond	278
use	279
public	280
concern	281
director	282
spokesman	283
current	284
service	285
close	286
due	287
officer	288
late	289
small	290
far	291
too	292
based	293
british	294
street	295
assets	296
today	297
added	298
fund	299
agreement	300
him	301
yen	302
law	303
already	304
least	305
think	306
until	307
case	308
oct.	309
congress	310
real	311
value	312
number	313
agency	314
contract	315
going	316
union	317
ended	318
city	319
same	320
wall	321
little	322
operating	323
september	324
services	325
home	326
dollar	327
california	328
points	329
though	330
san	331
economy	332
stake	333
called	334
put	335
period	336
results	337
move	338
research	339
second	340
help	341
agreed	342
four	343
see	344
administration	345
buying	346
selling	347
maker	348
without	349
here	350
former	351
total	352
firms	353
point	354
analyst	355
around	356
offering	357
problems	358
long	359
want	360
loans	361
corporate	362
west	363
power	364
six	365
production	366
compared	367
whether	368
dow	369
monday	370
third-quarter	371
credit	372
set	373
ual	374
cost	375
although	376
go	377
half	378
recently	379
right	380
annual	381
likely	382
cut	383
losses	384
country	385
increased	386
further	387
control	388
john	389
august	390
volume	391
strong	392
continue	393
expects	394
notes	395
committee	396
large	397
takeover	398
old	399
policy	400
yet	401
drop	402
london	403
declined	404
plant	405
my	406
soviet	407
junk	408
wo	409
life	410
systems	411
decline	412
result	413
political	414
times	415
inc	416
must	417
held	418
weeks	419
industrial	420
gain	421
chicago	422
announced	423
senior	424
fiscal	425
association	426
change	427
support	428
air	429
jones	430
come	431
largest	432
making	433
series	434
become	435
white	436
line	437
workers	438
give	439
certain	440
demand	441
senate	442
south	443
composite	444
paper	445
judge	446
problem	447
show	448
latest	449
nov.	450
nearly	451
employees	452
commission	453
orders	454
commercial	455
took	456
members	457
example	458
francisco	459
record	460
businesses	461
official	462
estate	463
loan	464
paid	465
acquisition	466
executives	467
priced	468
estimated	469
better	470
development	471
level	472
trust	473
others	474
deal	475
need	476
later	477
began	478
comment	479
purchase	480
texas	481
data	482
meeting	483
washington	484
despite	485
addition	486
october	487
proposed	488
rise	489
product	490
nation	491
holding	492
technology	493
area	494
ms.	495
your	496
know	497
nine	498
currently	499
offered	500
almost	501
possible	502
spending	503
robert	504
building	505
health	506
us	507
earthquake	508
once	509
proposal	510
investor	511
dropped	512
future	513
return	514
force	515
received	516
customers	517
steel	518
came	519
within	520
order	521
top	522
expect	523
terms	524
include	525
amount	526
information	527
europe	528
every	529
programs	530
trying	531
gas	532
named	533
defense	534
america	535
decision	536
tuesday	537
often	538
ford	539
changes	540
gains	541
filed	542
equipment	543
again	544
charge	545
drug	546
keep	547
ca	548
position	549
damage	550
east	551
ltd.	552
never	553
july	554
lot	555
united	556
enough	557
rights	558
told	559
financing	560
james	561
local	562
private	563
budget	564
previous	565
division	566
managers	567
following	568
great	569
fall	570
additional	571
buy-out	572
outstanding	573
european	574
found	575
finance	576
got	577
industries	578
options	579
co	580
able	581
mortgage	582
provide	583
transaction	584
fed	585
corp	586
whose	587
banking	588
car	589
computers	590
manager	591
've	592
things	593
run	594
away	595
tokyo	596
advertising	597
continued	598
action	599
shareholders	600
marketing	601
makes	602
china	603
black	604
important	605
june	606
instead	607
ad	608
dollars	609
best	610
contracts	611
place	612
sept.	613
consumer	614
university	615
rather	616
lost	617
equity	618
low	619
below	620
states	621
asked	622
bills	623
soon	624
airlines	625
believe	626
inflation	627
via	628
units	629
posted	630
getting	631
head	632
warner	633
food	634
charges	635
auto	636
suit	637
network	638
look	639
family	640
jaguar	641
full	642
march	643
above	644
claims	645
open	646
account	647
led	648
taken	649
meanwhile	650
raise	651
face	652
personal	653
boston	654
los	655
domestic	656
potential	657
included	658
stores	659
fact	660
legal	661
left	662
canada	663
talks	664
construction	665
subsidiary	666
ibm	667
itself	668
calls	669
makers	670
security	671
d.	672
long-term	673
working	674
special	675
risk	676
portfolio	677
similar	678
western	679
dealers	680
figures	681
canadian	682
bought	683
tv	684
secretary	685
restructuring	686
gold	687
germany	688
crash	689
statement	690
reached	691
previously	692
along	693
david	694
probably	695
available	696
mrs.	697
reserve	698
find	699
magazine	700
reports	701
individual	702
effort	703
party	704
countries	705
labor	706
savings	707
standard	708
holders	709
parent	710
performance	711
biggest	712
effect	713
looking	714
increases	715
pacific	716
hard	717
given	718
either	719
school	720
television	721
remain	722
reduce	723
dividend	724
noted	725
using	726
energy	727
profits	728
known	729
#	730
machines	731
center	732
lawyers	733
saying	734
cars	735
buyers	736
approval	737
cases	738
hit	739
efforts	740
investments	741
coming	742
hong	743
free	744
venture	745
why	746
approved	747
short	748
chemical	749
payments	750
telephone	751
call	752
groups	753
having	754
went	755
north	756
merrill	757
retail	758
helped	759
joint	760
britain	761
airline	762
different	763
raised	764
year-earlier	765
estimates	766
levels	767
institute	768
especially	769
clients	770
remains	771
huge	772
lead	773
angeles	774
communications	775
s&p	776
growing	777
heavy	778
acquired	779
percentage	780
ever	781
clear	782
manufacturing	783
lynch	784
slightly	785
strategy	786
columbia	787
act	788
william	789
brokerage	790
kong	791
something	792
german	793
particularly	794
attorney	795
legislation	796
eastern	797
gained	798
leading	799
job	800
really	801
interests	802
thing	803
marks	804
fees	805
activity	806
view	807
transportation	808
institutions	809
failed	810
question	811
begin	812
completed	813
name	814
team	815
rules	816
gm	817
rally	818
deficit	819
lines	820
pressure	821
leaders	822
project	823
taking	824
wants	825
me	826
military	827
holdings	828
michael	829
process	830
directors	831
acquire	832
toward	833
producers	834
seeking	835
build	836
plunge	837
outside	838
competition	839
includes	840
turn	841
start	842
course	843
limited	844
related	845
role	846
medical	847
hours	848
started	849
seems	850
reason	851
bad	852
owns	853
disclosed	854
themselves	855
means	856
hold	857
seven	858
central	859
'm	860
bay	861
calif.	862
fourth	863
young	864
plants	865
campaign	866
independent	867
generally	868
goods	869
leader	870
sony	871
concerns	872
reserves	873
shearson	874
vote	875
scheduled	876
poor	877
basis	878
meet	879
april	880
sen.	881
man	882
daily	883
reduced	884
issued	885
adds	886
richard	887
currency	888
district	889
involved	890
largely	891
conference	892
regulators	893
perhaps	894
quickly	895
estimate	896
turned	897
key	898
doing	899
always	900
majority	901
try	902
measure	903
areas	904
beginning	905
morgan	906
thrift	907
range	908
press	909
rep.	910
bankers	911
drexel	912
significant	913
longer	914
j.	915
'll	916
ahead	917
french	918
needed	919
allow	920
done	921
property	922
accounts	923
impact	924
thought	925
consider	926
considered	927
test	928
caused	929
projects	930
electric	931
de	932
night	933
traded	934
seen	935
shows	936
subject	937
france	938
eight	939
study	940
care	941
planned	942
supply	943
brokers	944
staff	945
paul	946
thursday	947
situation	948
community	949
nothing	950
plc	951
partners	952
journal	953
sharply	954
abortion	955
auction	956
congressional	957
housing	958
december	959
anything	960
let	961
stock-index	962
prime	963
settlement	964
parts	965
kind	966
space	967
wednesday	968
base	969
manufacturers	970
history	971
war	972
became	973
smaller	974
hurt	975
simply	976
a.	977
aid	978
delivery	979
short-term	980
motor	981
jumped	982
created	983
opened	984
justice	985
earned	986
produce	987
near	988
yields	989
george	990
worth	991
indeed	992
men	993
side	994
continuing	995
changed	996
protection	997
showed	998
required	999
volatility	1000
floor	1001
brothers	1002
tons	1003
taxes	1004
exports	1005
summer	1006
software	1007
preferred	1008
receive	1009
women	1010
democratic	1011
natural	1012
form	1013
increasing	1014
seem	1015
dec.	1016
giant	1017
recession	1018
sent	1019
partner	1020
boost	1021
usually	1022
difficult	1023
merger	1024
moody	1025
hopes	1026
note	1027
owned	1028
ways	1029
closely	1030
session	1031
active	1032
media	1033
filing	1034
game	1035
morning	1036
thus	1037
per	1038
benefits	1039
minister	1040
initial	1041
produced	1042
imports	1043
announcement	1044
conditions	1045
won	1046
cbs	1047
article	1048
convertible	1049
hand	1050
resources	1051
children	1052
strike	1053
closing	1054
seek	1055
wanted	1056
feel	1057
attempt	1058
capacity	1059
entertainment	1060
returns	1061
block	1062
advanced	1063
overseas	1064
francs	1065
evidence	1066
source	1067
red	1068
associates	1069
creditors	1070
continues	1071
environmental	1072
pound	1073
transactions	1074
rest	1075
size	1076
consumers	1077
main	1078
leveraged	1079
actually	1080
bankruptcy	1081
limit	1082
spokeswoman	1083
smith	1084
post	1085
pilots	1086
arbitrage	1087
final	1088
dr.	1089
directly	1090
field	1091
light	1092
member	1093
hope	1094
comes	1095
express	1096
sector	1097
letter	1098
rising	1099
shareholder	1100
'd	1101
sure	1102
term	1103
introduced	1104
water	1105
machine	1106
cancer	1107
together	1108
designed	1109
instance	1110
across	1111
mark	1112
behind	1113
noriega	1114
forced	1115
partly	1116
followed	1117
americans	1118
trader	1119
fully	1120
peter	1121
quality	1122
minimum	1123
built	1124
running	1125
brought	1126
believes	1127
whole	1128
require	1129
sense	1130
separate	1131
decided	1132
questions	1133
himself	1134
stop	1135
apparently	1136
bring	1137
play	1138
economists	1139
response	1140
serious	1141
spent	1142
moves	1143
offers	1144
sec	1145
battle	1146
effective	1147
lehman	1148
minutes	1149
economist	1150
gave	1151
age	1152
agencies	1153
various	1154
digital	1155
paying	1156
institutional	1157
matter	1158
chain	1159
ability	1160
farmers	1161
operation	1162
discount	1163
january	1164
ruling	1165
overall	1166
supreme	1167
provision	1168
unchanged	1169
quarterly	1170
offices	1171
authority	1172
allowed	1173
rule	1174
veto	1175
declines	1176
newspaper	1177
single	1178
jobs	1179
contributed	1180
expenses	1181
sign	1182
irs	1183
survey	1184
sharp	1185
moreover	1186
trial	1187
hugo	1188
funding	1189
cause	1190
quake	1191
brand	1192
figure	1193
highly	1194
salomon	1195
deals	1196
needs	1197
idea	1198
real-estate	1199
facilities	1200
trades	1201
quoted	1202
actual	1203
unless	1204
land	1205
wage	1206
over-the-counter	1207
pretax	1208
talk	1209
kidder	1210
moved	1211
step	1212
benefit	1213
civil	1214
spring	1215
widely	1216
signed	1217
provisions	1218
offset	1219
payment	1220
jr.	1221
holds	1222
specific	1223
forces	1224
organization	1225
commerce	1226
valley	1227
greater	1228
improve	1229
direct	1230
woman	1231
date	1232
avoid	1233
r.	1234
interview	1235
leave	1236
headquarters	1237
slow	1238
flat	1239
partnership	1240
southern	1241
spend	1242
hurricane	1243
relatively	1244
review	1245
resigned	1246
alone	1247
create	1248
takes	1249
mutual	1250
improved	1251
indicated	1252
margins	1253
focus	1254
democrats	1255
pension	1256
developed	1257
par	1258
package	1259
add	1260
negotiations	1261
premium	1262
opposition	1263
sports	1264
emergency	1265
hutton	1266
hour	1267
appear	1268
opening	1269
ministry	1270
cuts	1271
speculation	1272
exchanges	1273
charles	1274
fear	1275
customer	1276
met	1277
stanley	1278
reagan	1279
separately	1280
positions	1281
u.k.	1282
win	1283
council	1284
asset	1285
aircraft	1286
willing	1287
else	1288
provided	1289
develop	1290
gorbachev	1291
poland	1292
producer	1293
decade	1294
otc	1295
motors	1296
regional	1297
section	1298
beyond	1299
standards	1300
ads	1301
hands	1302
valued	1303
capital-gains	1304
worked	1305
provides	1306
radio	1307
human	1308
familiar	1309
existing	1310
book	1311
stay	1312
australia	1313
climbed	1314
electronic	1315
reflecting	1316
adding	1317
investigation	1318
bear	1319
remaining	1320
art	1321
cable	1322
death	1323
guber	1324
baker	1325
individuals	1326
november	1327
managing	1328
appears	1329
education	1330
planning	1331
safety	1332
peters	1333
electronics	1334
internal	1335
popular	1336
nasdaq	1337
properties	1338
goes	1339
larger	1340
substantial	1341
reach	1342
works	1343
tough	1344
chance	1345
bids	1346
competitors	1347
moving	1348
proceeds	1349
commodity	1350
dinkins	1351
everyone	1352
qintex	1353
film	1354
dividends	1355
option	1356
modest	1357
totaled	1358
read	1359
carrier	1360
regulatory	1361
conservative	1362
activities	1363
sometimes	1364
purchases	1365
amounts	1366
fight	1367
version	1368
success	1369
nor	1370
measures	1371
bell	1372
materials	1373
researchers	1374
phone	1375
owners	1376
county	1377
elected	1378
johnson	1379
thomas	1380
rejected	1381
tell	1382
passed	1383
target	1384
gulf	1385
students	1386
lawyer	1387
backed	1388
negative	1389
santa	1390
room	1391
events	1392
debentures	1393
weekend	1394
painewebber	1395
so-called	1396
policies	1397
social	1398
prevent	1399
trouble	1400
strength	1401
interested	1402
lawmakers	1403
store	1404
list	1405
maintain	1406
saw	1407
mexico	1408
experts	1409
mostly	1410
cited	1411
bureau	1412
broadcasting	1413
considering	1414
story	1415
expectations	1416
feet	1417
stand	1418
drugs	1419
manhattan	1420
lin	1421
raising	1422
nissan	1423
output	1424
image	1425
weak	1426
necessary	1427
true	1428
goldman	1429
certainly	1430
criminal	1431
lack	1432
apple	1433
eventually	1434
practice	1435
rating	1436
c$	1437
consultant	1438
attention	1439
details	1440
giving	1441
finally	1442
factors	1443
accounting	1444
grew	1445
traditional	1446
reduction	1447
world-wide	1448
opportunity	1449
grand	1450
approach	1451
prepared	1452
retirement	1453
miles	1454
houses	1455
export	1456
entire	1457
pence	1458
typically	1459
expansion	1460
clearly	1461
troubled	1462
tomorrow	1463
engineering	1464
neither	1465
class	1466
increasingly	1467
publicly	1468
cover	1469
trend	1470
anyone	1471
nbc	1472
e.	1473
everything	1474
collapse	1475
afternoon	1476
treatment	1477
advertisers	1478
immediately	1479
minority	1480
crude	1481
panel	1482
complete	1483
combined	1484
petroleum	1485
heavily	1486
gives	1487
spread	1488
brands	1489
tender	1490
mean	1491
carry	1492
college	1493
restrictions	1494
disaster	1495
believed	1496
aimed	1497
technical	1498
ones	1499
sought	1500
30-year	1501
declining	1502
boeing	1503
corporations	1504
numbers	1505
magazines	1506
particular	1507
original	1508
expensive	1509
accept	1510
republican	1511
players	1512
utilities	1513
municipal	1514
ohio	1515
bidding	1516
reorganization	1517
pentagon	1518
forecast	1519
copper	1520
revised	1521
police	1522
appropriations	1523
monthly	1524
kept	1525
northern	1526
person	1527
easy	1528
concerned	1529
chapter	1530
ownership	1531
affected	1532
someone	1533
subordinated	1534
gets	1535
travel	1536
mortgages	1537
items	1538
requirements	1539
jury	1540
sources	1541
korea	1542
attributed	1543
plus	1544
runs	1545
plunged	1546
drive	1547
year-ago	1548
falling	1549
monetary	1550
tried	1551
am	1552
difference	1553
centers	1554
broad	1555
ltd	1556
chemicals	1557
season	1558
acquisitions	1559
improvement	1560
soviets	1561
england	1562
park	1563
laws	1564
signs	1565
bridge	1566
lawson	1567
moscow	1568
us$	1569
brown	1570
controls	1571
roughly	1572
claim	1573
live	1574
owner	1575
wrong	1576
parties	1577
employee	1578
principal	1579
facility	1580
steps	1581
competitive	1582
deposits	1583
experience	1584
debate	1585
swiss	1586
design	1587
professional	1588
society	1589
florida	1590
represents	1591
pace	1592
homes	1593
access	1594
profitable	1595
vehicles	1596
released	1597
frank	1598
b.	1599
grow	1600
fixed	1601
unlike	1602
sachs	1603
ending	1604
recovery	1605
movie	1606
liquidity	1607
houston	1608
pending	1609
publishing	1610
chips	1611
primarily	1612
junk-bond	1613
litigation	1614
lloyd	1615
usx	1616
region	1617
ready	1618
failure	1619
lose	1620
powerful	1621
placed	1622
dispute	1623
campeau	1624
headed	1625
highest	1626
global	1627
paris	1628
purchased	1629
maturity	1630
couple	1631
relations	1632
victims	1633
settled	1634
nations	1635
wrote	1636
thousands	1637
pretty	1638
environment	1639
established	1640
sells	1641
reform	1642
continental	1643
values	1644
scientists	1645
amid	1646
expand	1647
crime	1648
balance	1649
dallas	1650
alleged	1651
release	1652
risks	1653
ratings	1654
starting	1655
l.	1656
margin	1657
actions	1658
st.	1659
listed	1660
quite	1661
push	1662
successful	1663
intelligence	1664
appeal	1665
saatchi	1666
uncertainty	1667
thrifts	1668
chinese	1669
ag	1670
whom	1671
m.	1672
developing	1673
confidence	1674
supplies	1675
maybe	1676
split	1677
paribas	1678
ventures	1679
fraud	1680
charged	1681
waiting	1682
putting	1683
thatcher	1684
agree	1685
ease	1686
sun	1687
philip	1688
segment	1689
mainly	1690
sort	1691
normal	1692
except	1693
words	1694
elections	1695
throughout	1696
mind	1697
portion	1698
favor	1699
no.	1700
threat	1701
editor	1702
reasons	1703
launched	1704
involving	1705
hotel	1706
ordered	1707
guilty	1708
slowing	1709
mae	1710
election	1711
showing	1712
p.m.	1713
core	1714
usual	1715
flow	1716
mass.	1717
arizona	1718
effects	1719
town	1720
weakness	1721
request	1722
complex	1723
buildings	1724
seemed	1725
predicted	1726
model	1727
lincoln	1728
proposals	1729
relief	1730
aerospace	1731
client	1732
high-yield	1733
communist	1734
alan	1735
losing	1736
advance	1737
w.	1738
consulting	1739
adjusted	1740
benchmark	1741
voters	1742
rated	1743
mccaw	1744
surged	1745
leaving	1746
unusual	1747
cray	1748
republicans	1749
primary	1750
bigger	1751
corn	1752
associated	1753
navy	1754
n.j.	1755
managed	1756
heart	1757
substantially	1758
c.	1759
healthy	1760
remained	1761
tests	1762
morris	1763
slowdown	1764
circuit	1765
appeals	1766
elsewhere	1767
thinks	1768
decide	1769
fewer	1770
assistant	1771
automotive	1772
stations	1773
representatives	1774
uses	1775
buyer	1776
protect	1777
controlled	1778
amr	1779
moment	1780
present	1781
stronger	1782
soared	1783
talking	1784
amendment	1785
advantage	1786
ground	1787
hundreds	1788
accord	1789
practices	1790
temporary	1791
schools	1792
faces	1793
pages	1794
jersey	1795
appeared	1796
none	1797
responsible	1798
century	1799
gene	1800
gone	1801
networks	1802
damaged	1803
fears	1804
stephen	1805
equal	1806
integrated	1807
opinion	1808
stopped	1809
frankfurt	1810
truck	1811
mail	1812
broker	1813
annually	1814
sides	1815
underwriters	1816
prosecutors	1817
warrants	1818
lending	1819
material	1820
producing	1821
double	1822
telecommunications	1823
coast	1824
barrels	1825
critics	1826
navigation	1827
blue	1828
trucks	1829
mitsubishi	1830
burnham	1831
mixed	1832
coupon	1833
doubt	1834
italy	1835
bit	1836
parents	1837
sterling	1838
reflect	1839
positive	1840
shift	1841
ask	1842
felt	1843
operate	1844
significantly	1845
delay	1846
wide	1847
slide	1848
strategic	1849
deposit	1850
affairs	1851
flight	1852
panama	1853
metals	1854
prior	1855
opposed	1856
break	1857
direction	1858
played	1859
hills	1860
exxon	1861
dozen	1862
follows	1863
employment	1864
challenge	1865
insurers	1866
documents	1867
reflects	1868
devices	1869
structure	1870
hill	1871
manville	1872
jack	1873
virtually	1874
australian	1875
suggested	1876
liability	1877
books	1878
nuclear	1879
instruments	1880
adviser	1881
puts	1882
b.a.t	1883
goal	1884
traffic	1885
baseball	1886
accused	1887
specialists	1888
fire	1889
affect	1890
leadership	1891
sears	1892
hostile	1893
utility	1894
hearing	1895
cities	1896
deputy	1897
reflected	1898
music	1899
distribution	1900
hollywood	1901
citing	1902
ban	1903
rumors	1904
aug.	1905
operates	1906
defendants	1907
accepted	1908
patent	1909
georgia-pacific	1910
hud	1911
models	1912
residents	1913
suspended	1914
exercise	1915
sir	1916
conventional	1917
represent	1918
sea	1919
mayor	1920
voted	1921
influence	1922
contrast	1923
event	1924
army	1925
ii	1926
anc	1927
seats	1928
africa	1929
follow	1930
fine	1931
speed	1932
mixte	1933
keeping	1934
happen	1935
certificates	1936
weekly	1937
damages	1938
pricing	1939
twice	1940
returned	1941
minor	1942
fairly	1943
krenz	1944
suggest	1945
crisis	1946
trillion	1947
fifth	1948
machinists	1949
cutting	1950
front	1951
intel	1952
task	1953
newspapers	1954
commitments	1955
boosted	1956
panic	1957
star	1958
retailers	1959
ec	1960
february	1961
older	1962
intended	1963
outlook	1964
per-share	1965
living	1966
jump	1967
lambert	1968
blacks	1969
wake	1970
abc	1971
immediate	1972
hospital	1973
telerate	1974
golden	1975
statistics	1976
decisions	1977
t.	1978
comparable	1979
finished	1980
professor	1981
station	1982
families	1983
citicorp	1984
happened	1985
sci	1986
worried	1987
at&t	1988
saturday	1989
green	1990
voice	1991
phillips	1992
courts	1993
resolution	1994
joined	1995
determined	1996
attorneys	1997
replace	1998
wells	1999
settle	2000
save	2001
piece	2002
pharmaceutical	2003
excess	2004
shown	2005
games	2006
phelan	2007
senators	2008
cds	2009
argue	2010
confirmed	2011
p&g	2012
preliminary	2013
movies	2014
prospects	2015
agreements	2016
worry	2017
candidates	2018
h.	2019
compromise	2020
s.a.	2021
sound	2022
abroad	2023
highway	2024
discussions	2025
providing	2026
suggests	2027
glass	2028
invest	2029
declared	2030
language	2031
written	2032
volatile	2033
chrysler	2034
asking	2035
alternative	2036
studies	2037
operator	2038
joseph	2039
prove	2040
finding	2041
fallen	2042
guidelines	2043
lee	2044
reaction	2045
judges	2046
vehicle	2047
extremely	2048
serve	2049
guarantee	2050
word	2051
relationship	2052
one-time	2053
advisers	2054
training	2055
initiative	2056
refused	2057
rjr	2058
giants	2059
sugar	2060
disclose	2061
audience	2062
reporting	2063
toronto	2064
assistance	2065
slipped	2066
ounce	2067
names	2068
fair	2069
guarantees	2070
oakland	2071
safe	2072
compaq	2073
purchasing	2074
interstate	2075
scandal	2076
applied	2077
representing	2078
worse	2079
ge	2080
gross	2081
silver	2082
brady	2083
church	2084
antitrust	2085
upon	2086
aggressive	2087
discovered	2088
urban	2089
s.	2090
matters	2091
f.	2092
entered	2093
authorities	2094
suffered	2095
regular	2096
file	2097
drives	2098
denied	2099
regulations	2100
setting	2101
extended	2102
quick	2103
served	2104
halt	2105
looks	2106
formed	2107
usair	2108
coverage	2109
eye	2110
asia	2111
type	2112
tend	2113
spot	2114
extent	2115
beijing	2116
underlying	2117
consultants	2118
style	2119
launch	2120
pact	2121
votes	2122
extra	2123
sotheby	2124
chase	2125
possibility	2126
expressed	2127
views	2128
1980s	2129
argued	2130
proceedings	2131
stearns	2132
meetings	2133
reporters	2134
negotiating	2135
fannie	2136
fourth-quarter	2137
handle	2138
colleagues	2139
tumbled	2140
attract	2141
politics	2142
retailing	2143
obtain	2144
initially	2145
donald	2146
mca	2147
visit	2148
join	2149
surge	2150
generation	2151
succeeds	2152
basic	2153
color	2154
triggered	2155
sunday	2156
critical	2157
pursue	2158
factory	2159
edward	2160
choice	2161
shopping	2162
newly	2163
unlikely	2164
club	2165
voting	2166
six-month	2167
differences	2168
nekoosa	2169
branch	2170
membership	2171
rival	2172
river	2173
signal	2174
pictures	2175
patients	2176
costly	2177
flights	2178
farm	2179
warned	2180
pipeline	2181
intends	2182
wife	2183
extraordinary	2184
switzerland	2185
10-year	2186
picture	2187
banker	2188
promise	2189
shipments	2190
records	2191
publisher	2192
luxury	2193
square	2194
consecutive	2195
king	2196
condition	2197
specialty	2198
conn.	2199
jan.	2200
pass	2201
ties	2202
swings	2203
taxpayers	2204
la	2205
n.y.	2206
quarters	2207
obligation	2208
movement	2209
chains	2210
manufacturer	2211
described	2212
1970s	2213
concluded	2214
door	2215
league	2216
exploration	2217
shipping	2218
circulation	2219
population	2220
processing	2221
adopted	2222
easily	2223
responsibility	2224
worst	2225
strategies	2226
participants	2227
insured	2228
rich	2229
nobody	2230
singapore	2231
industrials	2232
personnel	2233
covered	2234
criticism	2235
wang	2236
lives	2237
investing	2238
bottom	2239
constitutional	2240
discuss	2241
fuel	2242
cold	2243
metropolitan	2244
illegal	2245
resulting	2246
nature	2247
faster	2248
ceiling	2249
privately	2250
crop	2251
mother	2252
pushed	2253
track	2254
shortly	2255
rapidly	2256
carriers	2257
stage	2258
offerings	2259
indicate	2260
caught	2261
knows	2262
chip	2263
fe	2264
road	2265
stock-market	2266
died	2267
pick	2268
lenders	2269
institution	2270
begun	2271
specialist	2272
louis	2273
structural	2274
subcommittee	2275
ruled	2276
calling	2277
understand	2278
observers	2279
mine	2280
spain	2281
carried	2282
millions	2283
calif	2284
assembly	2285
speech	2286
acquiring	2287
hewlett-packard	2288
severe	2289
fast	2290
ultimately	2291
unable	2292
georgia	2293
trump	2294
scientific	2295
father	2296
pittsburgh	2297
title	2298
excluding	2299
jointly	2300
alliance	2301
restaurant	2302
grown	2303
mitchell	2304
cross	2305
normally	2306
bailout	2307
temporarily	2308
football	2309
hear	2310
mining	2311
succeed	2312
opportunities	2313
limits	2314
forecasts	2315
controversial	2316
watch	2317
sees	2318
invested	2319
inventories	2320
quantum	2321
student	2322
takeovers	2323
resume	2324
deliver	2325
atlantic	2326
requires	2327
heat	2328
extend	2329
mac	2330
cd	2331
politicians	2332
creating	2333
expanding	2334
rebound	2335
attack	2336
collection	2337
coffee	2338
helping	2339
resignation	2340
faced	2341
urged	2342
lowered	2343
factor	2344
massive	2345
simple	2346
carolina	2347
presence	2348
democracy	2349
counsel	2350
governments	2351
fields	2352
realize	2353
shot	2354
davis	2355
prudential-bache	2356
metric	2357
grain	2358
learned	2359
aside	2360
child	2361
types	2362
pushing	2363
semiconductor	2364
israel	2365
turning	2366
coup	2367
progress	2368
suits	2369
technologies	2370
lawsuits	2371
guaranteed	2372
tied	2373
a.m.	2374
guy	2375
possibly	2376
miller	2377
douglas	2378
philadelphia	2379
turmoil	2380
sets	2381
branches	2382
ross	2383
gasoline	2384
ensure	2385
collapsed	2386
typical	2387
everybody	2388
cooperation	2389
reducing	2390
modern	2391
health-care	2392
administrative	2393
centrust	2394
household	2395
card	2396
hot	2397
import	2398
assume	2399
citizens	2400
merchandise	2401
committed	2402
easier	2403
atlanta	2404
wait	2405
letters	2406
heard	2407
alternatives	2408
middle	2409
write	2410
agent	2411
troubles	2412
playing	2413
facing	2414
stories	2415
van	2416
aids	2417
harder	2418
agents	2419
hungary	2420
hall	2421
otherwise	2422
friendly	2423
supposed	2424
friend	2425
nevertheless	2426
lawrence	2427
badly	2428
moderate	2429
soft	2430
costa	2431
allowing	2432
contends	2433
corporation	2434
hired	2435
seeks	2436
reforms	2437
two-year	2438
hearings	2439
garden	2440
prison	2441
approve	2442
comments	2443
studio	2444
cellular	2445
match	2446
prompted	2447
users	2448
heads	2449
ratio	2450
lawsuit	2451
b	2452
anticipated	2453
expense	2454
sophisticated	2455
india	2456
sell-off	2457
ran	2458
rooms	2459
culture	2460
airport	2461
commitment	2462
martin	2463
york-based	2464
editorial	2465
advice	2466
marshall	2467
career	2468
default	2469
bringing	2470
expanded	2471
greenspan	2472
freddie	2473
code	2474
check	2475
resistance	2476
inside	2477
enormous	2478
enterprises	2479
equivalent	2480
commodities	2481
gap	2482
dean	2483
fidelity	2484
blue-chip	2485
resulted	2486
awarded	2487
metal	2488
ogilvy	2489
fast-food	2490
delays	2491
attractive	2492
founder	2493
northeast	2494
answer	2495
beach	2496
disappointing	2497
affiliate	2498
statements	2499
portfolios	2500
friends	2501
divisions	2502
numerous	2503
somewhat	2504
supported	2505
merely	2506
graphics	2507
revenues	2508
predict	2509
exposure	2510
sudden	2511
threatened	2512
weaker	2513
circumstances	2514
brief	2515
fellow	2516
impossible	2517
foods	2518
allegations	2519
pulled	2520
steady	2521
pennsylvania	2522
turner	2523
becoming	2524
hampshire	2525
formerly	2526
christmas	2527
targets	2528
hooker	2529
site	2530
rivals	2531
korean	2532
plastic	2533
cheap	2534
maximum	2535
thin	2536
ship	2537
chancellor	2538
disk	2539
frequently	2540
buy-outs	2541
surprised	2542
widespread	2543
recalls	2544
rapid	2545
regarding	2546
three-month	2547
warning	2548
mountain	2549
boom	2550
secondary	2551
turns	2552
fashion	2553
roll	2554
video	2555
whatever	2556
orange	2557
retailer	2558
subsidies	2559
freedom	2560
strongly	2561
genes	2562
changing	2563
consolidated	2564
reading	2565
brooks	2566
variety	2567
cautious	2568
commissions	2569
tobacco	2570
confident	2571
merc	2572
seeing	2573
status	2574
prospect	2575
contributions	2576
rico	2577
coal	2578
airways	2579
wonder	2580
one-year	2581
billions	2582
maintenance	2583
promised	2584
fighting	2585
profitability	2586
wholesale	2587
carries	2588
dealer	2589
published	2590
nyse	2591
establish	2592
nikkei	2593
closer	2594
peabody	2595
educational	2596
quiet	2597
complained	2598
blame	2599
son	2600
theory	2601
watching	2602
handling	2603
filled	2604
two-thirds	2605
fundamental	2606
slid	2607
maxwell	2608
becomes	2609
surprising	2610
beer	2611
eliminate	2612
insist	2613
employers	2614
miami	2615
mass	2616
breeden	2617
transfer	2618
memory	2619
claimed	2620
exactly	2621
walter	2622
elaborate	2623
sellers	2624
foundation	2625
tower	2626
blood	2627
appointed	2628
unemployment	2629
delta	2630
retain	2631
baltimore	2632
indicates	2633
rtc	2634
viewed	2635
formal	2636
messrs.	2637
fresh	2638
one-third	2639
player	2640
applications	2641
consensus	2642
promotion	2643
lang	2644
pilot	2645
bob	2646
banco	2647
reputation	2648
line-item	2649
announce	2650
downturn	2651
winter	2652
causing	2653
after-tax	2654
deep	2655
determine	2656
encourage	2657
violations	2658
organizations	2659
currencies	2660
vs.	2661
developer	2662
tape	2663
merchant	2664
worker	2665
mich.	2666
harris	2667
viewers	2668
message	2669
channel	2670
gop	2671
unsecured	2672
genetic	2673
effectively	2674
cells	2675
looked	2676
noting	2677
identified	2678
apply	2679
delayed	2680
seat	2681
insurer	2682
borrowing	2683
massachusetts	2684
operators	2685
plastics	2686
doubled	2687
plummeted	2688
mason	2689
english	2690
bellsouth	2691
clean	2692
covering	2693
broken	2694
machinery	2695
shop	2696
table	2697
concept	2698
race	2699
sustained	2700
brewing	2701
honecker	2702
hunt	2703
developers	2704
illinois	2705
represented	2706
franchise	2707
permanent	2708
exceed	2709
recorded	2710
daniel	2711
nervous	2712
retired	2713
reasonable	2714
shops	2715
besides	2716
brazil	2717
kodak	2718
incentives	2719
wave	2720
explain	2721
buy-back	2722
introduce	2723
writer	2724
storage	2725
thomson	2726
bloc	2727
purpose	2728
demands	2729
keating	2730
nationwide	2731
combination	2732
victory	2733
simmons	2734
dead	2735
african	2736
procedures	2737
generate	2738
desire	2739
standing	2740
bet	2741
ought	2742
chamber	2743
crucial	2744
address	2745
risen	2746
sensitive	2747
fly	2748
analysis	2749
consumption	2750
enforcement	2751
virginia	2752
donaldson	2753
cast	2754
identify	2755
begins	2756
du	2757
connection	2758
s&l	2759
broke	2760
five-year	2761
aide	2762
sluggish	2763
parliament	2764
compete	2765
papers	2766
royal	2767
places	2768
developments	2769
appropriate	2770
broadcast	2771
economics	2772
narrow	2773
location	2774
renewed	2775
dealing	2776
priority	2777
syndicate	2778
campbell	2779
cycle	2780
nec	2781
totaling	2782
legislative	2783
wright	2784
subsidiaries	2785
yeargin	2786
occurred	2787
husband	2788
agriculture	2789
encouraged	2790
essentially	2791
supporters	2792
enter	2793
arrangement	2794
schedule	2795
divided	2796
aware	2797
detroit	2798
broader	2799
replaced	2800
engineers	2801
stands	2802
stable	2803
officers	2804
forms	2805
nicaragua	2806
round	2807
considerable	2808
lilly	2809
surprise	2810
apart	2811
packaging	2812
g.	2813
carrying	2814
fujitsu	2815
exclusive	2816
successor	2817
entirely	2818
planners	2819
filings	2820
host	2821
restaurants	2822
projections	2823
difficulties	2824
waste	2825
registered	2826
regulation	2827
handful	2828
intense	2829
guard	2830
guide	2831
interest-rate	2832
remarks	2833
achieved	2834
ranging	2835
delivered	2836
favorable	2837
complaints	2838
deadline	2839
financially	2840
forest	2841
thompson	2842
beat	2843
efficient	2844
programming	2845
respond	2846
turnover	2847
secured	2848
credibility	2849
gamble	2850
killed	2851
leaves	2852
features	2853
loyalty	2854
opec	2855
peace	2856
constitution	2857
send	2858
criticized	2859
slower	2860
viacom	2861
pulp	2862
steep	2863
nixon	2864
governor	2865
principle	2866
behalf	2867
assuming	2868
trends	2869
hanover	2870
arm	2871
sit	2872
indian	2873
arthur	2874
testing	2875
overnight	2876
purposes	2877
driving	2878
tight	2879
pont	2880
defensive	2881
recovered	2882
goals	2883
marketplace	2884
a$	2885
readers	2886
spirits	2887
slump	2888
wheat	2889
gen.	2890
involve	2891
expire	2892
roman	2893
barney	2894
kkr	2895
attempting	2896
engine	2897
reluctant	2898
approximately	2899
pressures	2900
fleet	2901
downward	2902
accounted	2903
rock	2904
meant	2905
planes	2906
forward	2907
compensation	2908
suddenly	2909
asian	2910
body	2911
mills	2912
argument	2913
indication	2914
mercantile	2915
comfortable	2916
conduct	2917
kill	2918
precious	2919
theater	2920
scale	2921
draw	2922
fans	2923
senator	2924
payable	2925
des	2926
device	2927
containers	2928
mci	2929
requiring	2930
wild	2931
competing	2932
repair	2933
hoped	2934
feeling	2935
edition	2936
shut	2937
speculators	2938
abandoned	2939
comprehensive	2940
ltv	2941
egg	2942
apparent	2943
monitor	2944
cleveland	2945
evening	2946
marine	2947
blamed	2948
indicators	2949
leverage	2950
wcrs	2951
intent	2952
newport	2953
deficit-reduction	2954
linked	2955
el	2956
abortions	2957
optimistic	2958
taiwan	2959
cincinnati	2960
eager	2961
bulk	2962
las	2963
hits	2964
sufficient	2965
toy	2966
plenty	2967
negotiated	2968
ortega	2969
suspension	2970
allen	2971
defend	2972
tom	2973
italian	2974
witter	2975
dutch	2976
experienced	2977
definitive	2978
reinsurance	2979
science	2980
mesa	2981
holiday	2982
starts	2983
dramatic	2984
imperial	2985
delmed	2986
regime	2987
acting	2988
packages	2989
asset-backed	2990
mergers	2991
classes	2992
acknowledged	2993
representative	2994
liberal	2995
democrat	2996
island	2997
berlin	2998
hoping	2999
barely	3000
departure	3001
engelken	3002
steinhardt	3003
d.c.	3004
cosmetics	3005
fla.	3006
medicine	3007
bar	3008
selected	3009
ride	3010
promote	3011
premiums	3012
fill	3013
relative	3014
grants	3015
license	3016
manage	3017
latin	3018
learn	3019
discussing	3020
miss	3021
jim	3022
activists	3023
halted	3024
canceled	3025
love	3026
responded	3027
allies	3028
daiwa	3029
corry	3030
basket	3031
mature	3032
spielvogel	3033
award	3034
stood	3035
holder	3036
occur	3037
westinghouse	3038
mainframe	3039
leads	3040
connecticut	3041
surplus	3042
convicted	3043
capped	3044
watched	3045
oppose	3046
psyllium	3047
icahn	3048
gonzalez	3049
timing	3050
crowd	3051
pool	3052
hardly	3053
eased	3054
denver	3055
coalition	3056
toyota	3057
rockefeller	3058
poll	3059
convert	3060
screen	3061
wine	3062
assumption	3063
earth	3064
obviously	3065
strip	3066
recover	3067
eggs	3068
treaty	3069
testimony	3070
phoenix	3071
learning	3072
shape	3073
avenue	3074
edison	3075
henry	3076
aetna	3077
engaged	3078
three-year	3079
writing	3080
trip	3081
contend	3082
cheaper	3083
imported	3084
peak	3085
weapons	3086
backing	3087
attitude	3088
falls	3089
biotechnology	3090
christopher	3091
category	3092
p.	3093
mcdonald	3094
associate	3095
odds	3096
aggressively	3097
pounds	3098
telegraph	3099
distributed	3100
recapitalization	3101
hundred	3102
solid	3103
decades	3104
warren	3105
behavior	3106
promises	3107
turnaround	3108
presented	3109
appreciation	3110
ends	3111
scott	3112
remic	3113
permission	3114
originally	3115
charging	3116
deaths	3117
michigan	3118
potentially	3119
obvious	3120
germans	3121
minneapolis	3122
indicating	3123
answers	3124
suffer	3125
author	3126
opponents	3127
remove	3128
shall	3129
fit	3130
ideas	3131
sons	3132
creative	3133
cap	3134
credits	3135
conservatives	3136
manages	3137
mary	3138
lufkin	3139
acts	3140
catch	3141
program-trading	3142
swap	3143
interbank	3144
candidate	3145
conducted	3146
coca-cola	3147
authorized	3148
causes	3149
search	3150
comparison	3151
telling	3152
rape	3153
kids	3154
secret	3155
earn	3156
thinking	3157
asbestos	3158
ships	3159
nasa	3160
robust	3161
unions	3162
pieces	3163
wolf	3164
handled	3165
onto	3166
galileo	3167
rebounded	3168
audit	3169
argues	3170
borrowed	3171
foot	3172
sheet	3173
allianz	3174
recognition	3175
1990s	3176
coke	3177
younger	3178
lewis	3179
improvements	3180
paintings	3181
brain	3182
gary	3183
upward	3184
busy	3185
start-up	3186
paramount	3187
compares	3188
pattern	3189
steven	3190
famous	3191
poverty	3192
copy	3193
cards	3194
disclosure	3195
tentatively	3196
gray	3197
expert	3198
rallied	3199
districts	3200
clearing	3201
dealings	3202
maine	3203
struck	3204
sam	3205
link	3206
drew	3207
high-risk	3208
succeeding	3209
ncnb	3210
webster	3211
mainframes	3212
shell	3213
weather	3214
owed	3215
productivity	3216
novel	3217
experiments	3218
whites	3219
exceeded	3220
flying	3221
roger	3222
easing	3223
happens	3224
sex	3225
proved	3226
rey	3227
founded	3228
recommended	3229
teams	3230
subscribers	3231
stadium	3232
duties	3233
merge	3234
teachers	3235
totally	3236
succeeded	3237
revive	3238
vary	3239
participation	3240
kennedy	3241
resolve	3242
underwriter	3243
scenario	3244
concrete	3245
resort	3246
factories	3247
va.	3248
raw	3249
sued	3250
harvard	3251
akzo	3252
malcolm	3253
stevens	3254
realized	3255
calculated	3256
pollution	3257
permit	3258
stakes	3259
attached	3260
afford	3261
fee	3262
referring	3263
detailed	3264
bidders	3265
urging	3266
burden	3267
aluminum	3268
supporting	3269
fda	3270
squeeze	3271
investment-grade	3272
dropping	3273
scores	3274
howard	3275
cotton	3276
plays	3277
disappointed	3278
choose	3279
surprisingly	3280
breakers	3281
mobil	3282
allows	3283
climate	3284
pa.	3285
permitted	3286
stability	3287
professionals	3288
labor-management	3289
concentrate	3290
veteran	3291
residential	3292
uncertain	3293
versions	3294
stress	3295
imposed	3296
controversy	3297
breaking	3298
powers	3299
weight	3300
supplier	3301
bankruptcy-law	3302
happy	3303
aviation	3304
zealand	3305
grant	3306
coors	3307
giuliani	3308
wish	3309
iii	3310
raises	3311
inquiry	3312
poison	3313
winning	3314
submitted	3315
joining	3316
organized	3317
anybody	3318
consideration	3319
helps	3320
donations	3321
drilling	3322
outcome	3323
gyrations	3324
merksamer	3325
pilson	3326
vegas	3327
resolved	3328
prefer	3329
rural	3330
commonwealth	3331
rowe	3332
receipts	3333
tone	3334
knew	3335
discussed	3336
anticipation	3337
departments	3338
electricity	3339
greatest	3340
eyes	3341
electrical	3342
caution	3343
cia	3344
stated	3345
hahn	3346
ill.	3347
mines	3348
nonetheless	3349
blow	3350
steadily	3351
carl	3352
gov.	3353
socialist	3354
memories	3355
polish	3356
fired	3357
penalties	3358
milk	3359
tiny	3360
reductions	3361
withdrawal	3362
symbol	3363
longtime	3364
importance	3365
technique	3366
sciences	3367
fbi	3368
barriers	3369
modestly	3370
classic	3371
explains	3372
refinery	3373
leasing	3374
pointed	3375
segments	3376
apparel	3377
chicken	3378
warrant	3379
stuff	3380
contractor	3381
automobile	3382
dismissed	3383
copies	3384
steelmakers	3385
disease	3386
texaco	3387
iowa	3388
depressed	3389
depending	3390
barrel	3391
projected	3392
dynamics	3393
midwest	3394
waertsilae	3395
fixed-rate	3396
completely	3397
judicial	3398
nomura	3399
requested	3400
subsequent	3401
hospitals	3402
exist	3403
malaysia	3404
stone	3405
legislators	3406
discontinued	3407
penalty	3408
financier	3409
steve	3410
hire	3411
page	3412
emerging	3413
deny	3414
rescue	3415
lease	3416
curb	3417
vast	3418
false	3419
arguments	3420
yes	3421
pays	3422
pill	3423
seasonally	3424
k	3425
consortium	3426
edge	3427
load	3428
marcos	3429
participate	3430
printing	3431
advised	3432
extension	3433
dennis	3434
contras	3435
maryland	3436
transport	3437
businessmen	3438
degree	3439
visitors	3440
newsletter	3441
farmer	3442
emphasis	3443
mission	3444
diversified	3445
greatly	3446
attracted	3447
kenneth	3448
bolster	3449
master	3450
streets	3451
mips	3452
expecting	3453
predicting	3454
eliminated	3455
committees	3456
structures	3457
justin	3458
favorite	3459
reaching	3460
foreign-exchange	3461
bikes	3462
publications	3463
gandhi	3464
rare	3465
beverly	3466
character	3467
articles	3468
lies	3469
carnival	3470
polls	3471
sitting	3472
pinkerton	3473
checks	3474
focused	3475
negotiable	3476
roberts	3477
outlets	3478
switch	3479
train	3480
involvement	3481
jenrette	3482
notice	3483
tennessee	3484
alexander	3485
slowed	3486
requests	3487
probe	3488
lists	3489
tools	3490
correct	3491
hefty	3492
freeway	3493
debts	3494
duty	3495
jeffrey	3496
therefore	3497
era	3498
consent	3499
ronald	3500
complain	3501
receiving	3502
seidman	3503
attempts	3504
wood	3505
assumed	3506
fox	3507
interesting	3508
cohen	3509
baby	3510
state-owned	3511
darman	3512
insisted	3513
straight	3514
tells	3515
obtained	3516
bloomingdale	3517
stateswest	3518
collateral	3519
necessarily	3520
display	3521
presidential	3522
retire	3523
artist	3524
maynard	3525
controlling	3526
counter	3527
reynolds	3528
inventory	3529
boren	3530
lebanon	3531
sweeping	3532
acres	3533
cos.	3534
second-largest	3535
maintained	3536
slight	3537
plane	3538
discipline	3539
adverse	3540
ariz.	3541
equities	3542
sanctions	3543
franklin	3544
harry	3545
aim	3546
hardware	3547
arms	3548
traditionally	3549
struggling	3550
freight	3551
improving	3552
credit-card	3553
comptroller	3554
officially	3555
findings	3556
amex	3557
mortgage-backed	3558
smoking	3559
mart	3560
seoul	3561
chosen	3562
missing	3563
dangerous	3564
restructure	3565
lots	3566
bases	3567
kellogg	3568
quotations	3569
academic	3570
difficulty	3571
mgm	3572
insists	3573
restore	3574
bullish	3575
gotten	3576
plea	3577
mill	3578
reality	3579
respectively	3580
flexibility	3581
bartlett	3582
remember	3583
expiration	3584
lift	3585
edt	3586
allegedly	3587
economies	3588
quotron	3589
house-senate	3590
studying	3591
laboratories	3592
showtime	3593
walls	3594
jose	3595
connaught	3596
adjustments	3597
rica	3598
lockheed	3599
perspective	3600
happening	3601
disney	3602
extensive	3603
grace	3604
capitol	3605
sentiment	3606
mix	3607
annualized	3608
foreigners	3609
studios	3610
zero-coupon	3611
doctors	3612
ordinary	3613
sat	3614
bethlehem	3615
pharmaceuticals	3616
cleared	3617
legislature	3618
adjustable	3619
rebels	3620
indictment	3621
retained	3622
well-known	3623
solution	3624
quotas	3625
fail	3626
boards	3627
survive	3628
unfair	3629
l.j.	3630
specifically	3631
strategist	3632
casualty	3633
pop	3634
charities	3635
failing	3636
bankamerica	3637
foster	3638
advocates	3639
ticket	3640
taylor	3641
plaintiffs	3642
components	3643
borrow	3644
characters	3645
periods	3646
merged	3647
notion	3648
sacramento	3649
conviction	3650
ton	3651
risky	3652
seriously	3653
black-and-white	3654
wages	3655
flag	3656
indications	3657
adjustment	3658
500-stock	3659
suppliers	3660
somebody	3661
trelleborg	3662
row	3663
dumped	3664
expires	3665
absolutely	3666
partnerships	3667
partial	3668
monitoring	3669
lowest	3670
performed	3671
fiat	3672
sectors	3673
aspects	3674
warsaw	3675
cattle	3676
philippines	3677
conner	3678
courter	3679
implications	3680
grounds	3681
casino	3682
unisys	3683
unfortunately	3684
ghost	3685
anyway	3686
recognized	3687
preparing	3688
stem	3689
lbo	3690
repurchase	3691
gnp	3692
seasonal	3693
pleaded	3694
diluted	3695
reportedly	3696
cathay	3697
theme	3698
covers	3699
marked	3700
injuries	3701
upham	3702
accident	3703
downtown	3704
reject	3705
scene	3706
surveyed	3707
190-point	3708
worries	3709
vulnerable	3710
posts	3711
aides	3712
scheme	3713
specified	3714
travelers	3715
recall	3716
respect	3717
completion	3718
vietnam	3719
count	3720
craig	3721
delaware	3722
conspiracy	3723
colorado	3724
tiger	3725
focusing	3726
restricted	3727
ambitious	3728
publication	3729
loan-loss	3730
apartment	3731
stepped	3732
similarly	3733
nearby	3734
lire	3735
republic	3736
discounting	3737
confusion	3738
taxable	3739
automatic	3740
kansas	3741
convinced	3742
ill	3743
killing	3744
considerably	3745
appointment	3746
a.m	3747
adequate	3748
impose	3749
produces	3750
quebecor	3751
rothschild	3752
belief	3753
weakening	3754
charity	3755
liabilities	3756
funded	3757
neighborhood	3758
hotels	3759
merieux	3760
usa	3761
cell	3762
stein	3763
ps	3764
excessive	3765
sole	3766
consistently	3767
incentive	3768
barry	3769
signaled	3770
greece	3771
depends	3772
durable	3773
advisory	3774
converted	3775
print	3776
revolution	3777
southeast	3778
admitted	3779
abuse	3780
dominated	3781
measured	3782
overhaul	3783
insider	3784
satellite	3785
wire	3786
acceptance	3787
lunch	3788
procter	3789
saab	3790
located	3791
racial	3792
sullivan	3793
samuel	3794
feared	3795
lackluster	3796
protected	3797
pull	3798
financed	3799
thousand	3800
conglomerate	3801
ralph	3802
storm	3803
olivetti	3804
kinds	3805
eagle	3806
guys	3807
method	3808
prospective	3809
missouri	3810
conceded	3811
saudi	3812
railroad	3813
nicholas	3814
terrorism	3815
lane	3816
fined	3817
approached	3818
respondents	3819
contest	3820
violated	3821
tracks	3822
passenger	3823
budgets	3824
bargain	3825
stockholders	3826
box	3827
milton	3828
setback	3829
mexican	3830
c	3831
random	3832
danger	3833
fueled	3834
wpp	3835
empire	3836
complaint	3837
injured	3838
persuade	3839
sand	3840
basically	3841
contain	3842
elderly	3843
failures	3844
seed	3845
reliance	3846
walk	3847
pleased	3848
facts	3849
affiliates	3850
alex	3851
replacement	3852
racketeering	3853
reacted	3854
mention	3855
bearish	3856
hastings	3857
toll	3858
loyal	3859
motion	3860
mgm\/ua	3861
disasters	3862
charter	3863
crimes	3864
bonuses	3865
informed	3866
honda	3867
forcing	3868
fat	3869
compound	3870
complicated	3871
globe	3872
1960s	3873
williams	3874
commissioner	3875
renaissance	3876
franchisees	3877
experiment	3878
youth	3879
oklahoma	3880
entry	3881
consequences	3882
cfcs	3883
staffers	3884
competitor	3885
raymond	3886
targeted	3887
unveiled	3888
rolling	3889
diego	3890
est	3891
rumored	3892
investigating	3893
irish	3894
loose	3895
angry	3896
dataproducts	3897
netherlands	3898
finds	3899
lock	3900
tire	3901
puerto	3902
panamanian	3903
momentum	3904
encouraging	3905
rent	3906
tool	3907
kentucky	3908
dozens	3909
adopt	3910
concessions	3911
ultimate	3912
shelf	3913
reset	3914
kemper	3915
admits	3916
contractors	3917
formally	3918
repeatedly	3919
agrees	3920
colgate	3921
discounts	3922
stick	3923
wars	3924
restrict	3925
picked	3926
ringers	3927
serving	3928
asks	3929
valuable	3930
confirm	3931
roy	3932
cleanup	3933
enable	3934
brussels	3935
speak	3936
concedes	3937
treasurys	3938
transferred	3939
skills	3940
rush	3941
surrounding	3942
sounds	3943
ball	3944
cent	3945
incurred	3946
suggesting	3947
tendered	3948
aftermath	3949
ministers	3950
banned	3951
edged	3952
doctor	3953
prominent	3954
landing	3955
carefully	3956
contained	3957
iron	3958
baskets	3959
application	3960
indicator	3961
owning	3962
obligations	3963
russian	3964
moon	3965
efficiency	3966
resorts	3967
introduction	3968
societe	3969
mentioned	3970
essential	3971
judgment	3972
touch	3973
amounted	3974
shortage	3975
microsoft	3976
conversion	3977
compiled	3978
achieve	3979
spill	3980
carpenter	3981
fargo	3982
explained	3983
highs	3984
bells	3985
tandem	3986
lend	3987
publishers	3988
consistent	3989
jet	3990
crunch	3991
cigarettes	3992
born	3993
mississippi	3994
swedish	3995
protests	3996
injunction	3997
mikhail	3998
negotiate	3999
combat	4000
laboratory	4001
seller	4002
averaged	4003
tw	4004
robertson	4005
lotus	4006
